
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="01.array.html" />
    
    
    <link rel="prev" href="dedication.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="dedication.html">
            
                <a href="dedication.html">
            
                    
                    献词
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="00.preface.html">
            
                <a href="00.preface.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="01.array.html">
            
                <a href="01.array.html">
            
                    
                    数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="translations.html">
            
                <a href="translations.html">
            
                    
                    附录：翻译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="translation-how-to.html">
            
                <a href="translation-how-to.html">
            
                    
                    附录：如何翻译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="feedback.html">
            
                <a href="feedback.html">
            
                    
                    反馈
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x8C08;&#x5230;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x591F;&#x60F3;&#x5230;&#x7684;&#x5F80;&#x5F80;&#x662F; C/C++/Java &#x7B49;&#x5F3A;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x4F46;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;PHP &#x7B49;&#x5F31;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5BF9;&#x5305;&#x62EC;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x5982;&#x94FE;&#x8868;&#x3001;&#x6808;&#x3001;&#x961F;&#x5217;&#x3001;&#x56FE;&#x7B49;&#xFF09;&#xFF0C;&#x6392;&#x5E8F;&#x548C;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x4E5F;&#x6709;&#x7740;&#x5F3A;&#x70C8;&#x7684;&#x9700;&#x6C42;&#x3002;&#x672C;&#x4E66;&#x8BA8;&#x8BBA;&#x5728;&#x4F7F;&#x7528; PHP &#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7F16;&#x7A0B;&#x65F6;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#xFF0C;&#x63A5;&#x53D7;&#x8FC7;&#x6B63;&#x89C4;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6559;&#x80B2;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6E05;&#x695A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x8010;&#x5FC3;&#x8BFB;&#x5B8C;&#x672C;&#x8282;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x535A;&#x58EB; Nicklaus Wirth &#x63D0;&#x51FA;&#x8FC7;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x516C;&#x5F0F;&#xFF0C;&#x201C;&#x7B97;&#x6CD5; + &#x6570;&#x636E;&#x7ED3;&#x6784; = &#x7A0B;&#x5E8F;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x6982;&#x8FF0;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x7684;&#x7CBE;&#x8981;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6709;&#x4E9B;&#x89C4;&#x6A21;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x9700;&#x8981;&#x67D0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7B97;&#x6CD5;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x8F93;&#x5165;&#x8F6C;&#x6362;&#x4E3A;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x975E;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6700;&#x719F;&#x6089;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E94;&#x8BE5;&#x5C31;&#x662F;&#x6570;&#x7EC4;&#x3002;&#x5728;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x6570;&#x7EC4;&#x662F;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x7EC4;&#x53EF;&#x80FD;&#x5C31;&#x663E;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x518D;&#x53BB;&#x8BBE;&#x8BA1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x7B97;&#x6CD5;&#x5C31;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#xFF08;BST&#xFF09;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8BBE;&#x8BA1;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x67E5;&#x627E;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x548C;&#x6700;&#x5927;&#x503C;&#x3002;&#x7531;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E5F;&#x5C31;&#x5F15;&#x7533;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x6BD4;&#x76EE;&#x524D;&#x5F88;&#x591A;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x6548;&#x7387;&#x90FD;&#x9AD8;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x719F;&#x6089;&#x4E8C;&#x53C9;&#x67E5;&#x627E;&#x6811;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x6548;&#x7387;&#x4E0A;&#x5C31;&#x4F1A;&#x6253;&#x6298;&#x6263;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x540C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x6709;&#x591A;&#x79CD;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x3001;&#x9AD8;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x591F;&#x6E05;&#x695A;&#x7684;&#x77E5;&#x9053;&#x54EA;&#x79CD;&#x7B97;&#x6CD5;&#x66F4;&#x9AD8;&#x6548;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x73B0;&#x5728;&#x81F3;&#x5C11;&#x6709;&#x516D;&#x4E03;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x6BD4;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x8BA9;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x9AD8;&#x6548;&#x3002;&#x53C8;&#x6BD4;&#x5982;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x67E5;&#x627E;&#x7684;&#x7B97;&#x6CD5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x77E5;&#x9053;&#x6709;&#x65F6;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x53EF;&#x80FD;&#x6BD4;&#x7EBF;&#x6027;&#x67E5;&#x627E;&#x5FEB;&#x4E24;&#x500D;&#x4EE5;&#x4E0A;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x4F1A;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x5149;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x54EA;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x8FD8;&#x4F1A;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x6700;&#x9002;&#x5408;&#x89E3;&#x51B3;&#x624B;&#x5934;&#x95EE;&#x9898;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x3002;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x6743;&#x8861;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x672C;&#x4E66;&#x6DB5;&#x76D6;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x5728;&#x89E3;&#x51B3;&#x5177;&#x4F53;&#x7684;&#x7F16;&#x7A0B;&#x95EE;&#x9898;&#x65F6;&#x5C31;&#x66F4;&#x80FD;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="php-&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x548C;&#x57FA;&#x7840;">PHP &#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x548C;&#x57FA;&#x7840;</h2>
<p>&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x6211;&#x7684;&#x53E6;&#x4E00;&#x672C;&#x57FA;&#x7840;&#x6559;&#x7A0B;&#x300A;&#x7B80;&#x660E; PHP &#x6559;&#x7A0B;&#x300B;&#x3002;&#x672C;&#x4E66;&#x7684;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x5C06;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5B9A;&#x4E49;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x7B97;&#x6CD5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="dedication.html" class="navigation navigation-prev " aria-label="Previous page: 献词">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="01.array.html" class="navigation navigation-next " aria-label="Next page: 数组">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.3","depth":1,"next":{"title":"数组","level":"1.4","depth":1,"path":"01.array.md","ref":"01.array.md","articles":[]},"previous":{"title":"献词","level":"1.2","depth":1,"path":"dedication.md","ref":"dedication.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"00.preface.md","mtime":"2020-05-02T09:13:13.193Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-05-02T13:55:24.185Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

